<?php

$items = array(
  array('id'=>1,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>2,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>3,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>4,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>5,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>6,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>7,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>8,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>9,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>10,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>11,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>12,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>13,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>14,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg"),
  array('id'=>15,'img1'=>"2020-10-02_16-31-44.jpg",'img2'=>"2020-10-02_16-29-33.jpg")
);
    //$message = json_encode($items,JSON_UNESCAPED_UNICODE);
	//描述：第二参数是将中文不转为UNICODE的编码（JSON_UNESCAPED_UNICODE），默认转换成UNICODE的编码；
	$message = json_encode($items);
    echo $message;

?>